core/app/Http/Controllers/SiteController.php

select * from `general_settings` limit 1
---
    public function __construct()
    {
        $general = GeneralSetting::first();

select * from `pages` where `name` = 'home' limit 1
select * from `plans` where `status` = 1
---
    public function index()
    {

        $pageTitle = 'Home';

        $sections = Page::where('name', 'home')->first();

        if (!$sections) {

            $sections = Page::create([
                'name' => 'home',
                'sections' => ['about'],
                'slug' => 'home',
                'seo_description' => 'home',
                'page_order' => 1
            ]);
        }

        $plan = Plan::where('status', 1)->get();

select * from `plans` where `status` = 1
---
    public function investmentPlan()
    {
        $pageTitle = "Investment Plan";
        $plans = Plan::where('status', 1)->get();

select * from `general_settings` limit 1
select * from `plans` where `plans`.`id` = '48' limit 1
select * from `times` where `times`.`id` in (23)
select count(*) as aggregate from `payments` where `user_id` = 816 and `plan_id` = 48
---
    public function investmentUsingBalannce(Request $request)
    {

        $request->validate([
            'amount' => 'required|numeric'
        ]);

        $general = GeneralSetting::first();

        $plan_id = Plan::with('time')->findOrFail($request->plan_id);

        $CheckUserPayments = Payment::where('user_id', auth()->id())
            ->where('plan_id', 48)
            ->count();

update `users` set `balance` = 19000, `users`.`updated_at` = '2025-02-28 22:52:45' where `id` = 816
insert into `payments` (`plan_id`, `gateway_id`, `user_id`, `transaction_id`, `amount`, `rate`, `charge`, `final_amount`, `payment_status`, `next_payment_date`, `updated_at`, `created_at`) values (48, 0, 816, 'SGUPE1J5SIDW3IRH', '1000', 0, 0, '1000', 1, '2025-02-28 22:52:45', '2025-02-28 22:52:45', '2025-02-28 22:52:45')
---
        }

        $user->balance = $user->balance - $request->amount;
        $user->save();

        $deposit = Payment::create([
            'plan_id' => $plan_id->id,
            'gateway_id' => 0,
            'user_id' => auth()->id(),
            'transaction_id' => $trx,
            'amount' => $request->amount,
            'rate' => 0,
            'charge' => 0,
            'final_amount' => $request->amount,
            'payment_status' => 1,
            'next_payment_date' => $next_payment_date,

        ]);

insert into `transactions` (`trx`, `gateway_id`, `amount`, `currency`, `details`, `charge`, `type`, `gateway_transaction`, `user_id`, `payment_status`, `updated_at`, `created_at`) values ('SGUPE1J5SIDW3IRH', 0, '1000', 'PKR', 'Payment Successfull', 0, '-', '', 816, 1, '2025-02-28 22:52:45', '2025-02-28 22:52:45')
---



        Transaction::create([
            'trx' => $deposit->transaction_id,
            'gateway_id' => $deposit->gateway_id,
            'amount' => $deposit->final_amount,
            'currency' => @$general->site_currency,
            'details' => 'Payment Successfull',
            'charge' => 0,
            'type' => '-',
            'gateway_transaction' => '',
            'user_id' => auth()->id(),
            'payment_status' => 1,
        ]);

select * from `plans` where `status` = 1
---
    public function allInvestmentPlan()
    {
        $pageTitle = "Investment Plan";
        $plans = Plan::where('status', 1)->get();