core/app/Http/Controllers/UserController.php

    public function __construct()
    {
        $general = GeneralSetting::first();
---
select * from `general_settings` limit 1

    public function dashboard()
    {


        $pageTitle = "Dashboard";
        $totalInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->sum('amount');
        $currentInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->latest()->first('amount');
        $currentPlan = Payment::with('plan')->where('user_id', Auth::id())->where('payment_status', 1)->latest()->first();
        $allPlan = Payment::with('plan')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'plan');
        $withdraw = Withdraw::where('user_id', Auth::id())->where('status', 1)->sum('withdraw_amount');
        $interestLogs = UserInterest::with('payment')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'log');

        $commison = RefferedCommission::where('reffered_by', Auth::id())->sum('amount');

        $pendingInvest = Payment::where('user_id', Auth::id())->where('payment_status', 2)->sum('amount');
        $pendingWithdraw = Withdraw::where('user_id', Auth::id())->where('status', 0)->sum('withdraw_amount');
        $totalDeposit = Deposit::where('user_id', Auth::id())->where('payment_status', 1)->sum('final_amount');

        $uplineUser = User::where('id', Auth::user()->reffered_by)->first();
---
select sum(`amount`) as aggregate from `payments` where `user_id` = 816 and `payment_status` = 1
select `amount` from `payments` where `user_id` = 816 and `payment_status` = 1 order by `created_at` desc limit 1
select * from `payments` where `user_id` = 816 and `payment_status` = 1 order by `created_at` desc limit 1
select * from `plans` where `plans`.`id` in (48)
select * from `payments` where `user_id` = 816 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `payments` where `user_id` = 816
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 816 and `status` = 1
select * from `payments` where `payments`.`id` in (462)
select * from `user_interests` where `user_id` = 816 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `user_interests` where `user_id` = 816
select sum(`amount`) as aggregate from `reffered_commissions` where `reffered_by` = 816
select sum(`amount`) as aggregate from `payments` where `user_id` = 816 and `payment_status` = 2
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 816 and `status` = 0
select sum(`final_amount`) as aggregate from `deposits` where `user_id` = 816 and `payment_status` = 1
select * from `users` where `id` = '0' limit 1

    public function withdraw()
    {
        $pageTitle = 'Withdraw Money';

        // Get available withdrawal methods
        $withdraws = WithdrawGateway::where('status', 1)->latest()->get();

        // Check if the user has an account bound
        $accountBind = AccountBind::where('user_id', auth()->id())->first();
---
select * from `withdraw_gateways` where `status` = 1 order by `created_at` desc
select * from `account_binds` where `user_id` = 816 limit 1

    public function withdrawCompleted(Request $request)
    {
        $checkInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->exists();

        if (!$checkInvest) {
            return redirect(url('dashboard'))->with('error', 'Please invest first before withdrawing.');
        }
        $general = GeneralSetting::first();

        // Check per-day withdrawal limit
        $withdrawCount = Withdraw::where('user_id', auth()->id())
            ->whereDate('created_at', now())
            ->count();

        if ($general->withdraw_limit <= $withdrawCount) {
            return back()->with('error', 'Per day withdrawal limit exceeded');
        }

        // Validate only the amount input
        $request->validate([
            'amount' => 'required|numeric|min:1',
        ]);

        // Check if the user has an account bound
        $accountBind = AccountBind::where('user_id', auth()->id())->first();
        if (!$accountBind) {
            return redirect(url('account/bind'))->with('error', 'You need to bind an account before withdrawing.');
        }

        // Fetch the withdrawal method from account_binds
        $withdrawMethod = WithdrawGateway::findOrFail($accountBind->withdraw_method_id);
---
select exists(select * from `payments` where `user_id` = 816 and `payment_status` = 1) as `exists`
select * from `general_settings` limit 1
select count(*) as aggregate from `withdraws` where `user_id` = 816 and date(`created_at`) = '2025-03-01'
select * from `account_binds` where `user_id` = 816 limit 1
select * from `withdraw_gateways` where `withdraw_gateways`.`id` = 4 limit 1


        // Deduct balance
        auth()->user()->balance -= $totalAmount;
        auth()->user()->save();

        // Store withdrawal data
        Withdraw::create([
            'user_id' => auth()->id(),
            'withdraw_method_id' => $accountBind->withdraw_method_id,
            'transaction_id' => strtoupper(Str::random(15)),
            'user_withdraw_prof' => [
                'email' => $accountBind->email,
                'account_information' => $accountBind->account_information,
                'note' => $accountBind->note,
            ],
            'withdraw_charge' => $withdrawCharge,
            'withdraw_amount' => $request->amount,
            'status' => 0
        ]);
---
update `users` set `balance` = 50, `users`.`updated_at` = '2025-03-01 12:44:40' where `id` = 816
insert into `withdraws` (`user_id`, `withdraw_method_id`, `transaction_id`, `user_withdraw_prof`, `withdraw_charge`, `withdraw_amount`, `status`, `updated_at`, `created_at`) values (816, 4, 'SP19MSBGQFDIUC0', '{\"email\":\"4912090\",\"account_information\":\"34090\",\"note\":\"2049\"}', 50, '1000', 0, '2025-03-01 12:44:40', '2025-03-01 12:44:40')

    public function accountBind()
    {
        $accountBind = AccountBind::where('user_id', auth()->id())->first();
        if ($accountBind) {
            return redirect(url('/dashboard'))->with('error', 'Some thing went wrong');
        }
        $pageTitle = "Bind Your Account";
        $withdrawMethods = WithdrawGateway::where('status', 1)->get();
---
select * from `account_binds` where `user_id` = 816 limit 1
select * from `withdraw_gateways` where `status` = 1

    public function withdrawFetch(Request $request)
    {
        $withdraw = WithdrawGateway::findOrFail($request->id);
---
select * from `withdraw_gateways` where `withdraw_gateways`.`id` = '4' limit 1

    public function allWithdraw(Request $request)
    {
        $pageTitle = 'All withdraw';

        $withdrawlogs = Withdraw::when($request->trx, function ($item) use ($request) {
            $item->where('transaction_id', $request->trx);
        })->when($request->date, function ($item) use ($request) {
            $item->whereDate('created_at', $request->date);
        })->where('user_id', auth()->id())->latest()->with('withdrawMethod')->paginate(10);
---
select * from `withdraws` where `user_id` = 816 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `withdraws` where `user_id` = 816

    public function PerfomanceChart()
    {
        $userId = auth()->user()->id;

        // **Step 1: Find Level 1 Users**
        $levelOneUsers = User::where('reffered_by', $userId)->pluck('id');

        // **Step 2: Find Level 2 Users**
        $levelTwoUsers = User::whereIn('reffered_by', $levelOneUsers)->pluck('id');

        // **Step 3: Find Level 3 Users**
        $levelThreeUsers = User::whereIn('reffered_by', $levelTwoUsers)->pluck('id');

        // **Level 1 Calculations**
        $levelOneUsersCount = $levelOneUsers->count();
        $totalInvestedAmountLevel1 = Payment::whereIn('user_id', $levelOneUsers)
            ->where('payment_status', 1)
            ->whereNotNull('next_payment_date') // ✅ Only running plans
            ->sum('amount');

        $totalPlansLevel1 = Payment::whereIn('user_id', $levelOneUsers)
            ->where('payment_status', 1)
            ->whereNotNull('next_payment_date') // ✅ Only running plans
            ->count();

        $totalInvestedMembersLevel1 = Payment::whereIn('user_id', $levelOneUsers)
            ->where('payment_status', 1)
            ->whereNotNull('next_payment_date') // ✅ Only running plans
            ->distinct('user_id')
            ->count('user_id');
---
select `id` from `users` where `reffered_by` = 816
select count(distinct `user_id`) as aggregate from `payments` where 0 = 1 and `payment_status` = 1 and `next_payment_date` is not null

            ->whereNotNull('next_payment_date') // ✅ Only running plans
            ->count();

        $totalInvestedMembersLevel2 = Payment::whereIn('user_id', $levelTwoUsers)
            ->where('payment_status', 1)
            ->whereNotNull('next_payment_date') // ✅ Only running plans
            ->distinct('user_id')
            ->count('user_id');
---
select count(distinct `user_id`) as aggregate from `payments` where 0 = 1 and `payment_status` = 1 and `next_payment_date` is not null

            ->whereNotNull('next_payment_date') // ✅ Only running plans
            ->count();

        $totalInvestedMembersLevel3 = Payment::whereIn('user_id', $levelThreeUsers)
            ->where('payment_status', 1)
            ->whereNotNull('next_payment_date') // ✅ Only running plans
            ->distinct('user_id')
            ->count('user_id');
---
select count(distinct `user_id`) as aggregate from `payments` where 0 = 1 and `payment_status` = 1 and `next_payment_date` is not null