core/app/Http/Controllers/UserController.php

    public function withdrawCompleted(Request $request)
    {
        $general = GeneralSetting::first();
        $checkInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->exists();
        if (!$checkInvest) {
            return redirect(url('dashboard'))->with('error', 'Please invest first before withdrawing.');
        }
        // Check per-day withdrawal limit
        $withdrawCount = Withdraw::where('user_id', auth()->id())->whereDate('created_at', now())->count();
        if ($general->withdraw_limit <= $withdrawCount) {
            return back()->with('error', 'Per day withdrawal limit exceeded');
        }

        // Validate only the amount input
        $request->validate([
            'amount' => 'required|numeric',
        ]);

        // Check if the user has an account bound
        $accountBind = AccountBind::where('user_id', auth()->id())->first();
        if (!$accountBind) {
            return redirect(url('account/bind'))->with('error', 'You need to bind an account before withdrawing.');
        }

        // Fetch the withdrawal method from account_binds
        $withdrawMethod = WithdrawGateway::findOrFail($accountBind->withdraw_method_id);
---
select * from `general_settings` limit 1
select count(*) as aggregate from `withdraws` where `user_id` = 816 and date(`created_at`) = '2025-03-01'
select * from `account_binds` where `user_id` = 816 limit 1
select * from `withdraw_gateways` where `withdraw_gateways`.`id` = 4 limit 1


        // Deduct balance
        auth()->user()->balance -= $total;
        auth()->user()->save();

        // Store withdrawal data
        Withdraw::create([
            'user_id' => auth()->id(),
            'withdraw_method_id' => $accountBind->withdraw_method_id,
            'transaction_id' => strtoupper(Str::random(15)),
            'user_withdraw_prof' => [
                'email' => $accountBind->email,
                'account_information' => $accountBind->account_information,
                'note' => $accountBind->note,
            ],
            'withdraw_charge' => $withdrawMethod->charge,
            'withdraw_amount' => $request->amount,
            'status' => 0
        ]);
---
update `users` set `balance` = 55, `users`.`updated_at` = '2025-03-01 13:24:25' where `id` = 816
insert into `withdraws` (`user_id`, `withdraw_method_id`, `transaction_id`, `user_withdraw_prof`, `withdraw_charge`, `withdraw_amount`, `status`, `updated_at`, `created_at`) values (816, 4, 'BF4VNNGYDZJMD7X', '{\"email\":\"4912090\",\"account_information\":\"34090\",\"note\":\"2049\"}', '5.00000000', '900', 0, '2025-03-01 13:24:25', '2025-03-01 13:24:25')

    public function PerfomanceChart()
    {
        $userId = auth()->user()->id;
        // Get the downline of the user (including indirect referrals)
        $downline = $this->getDownline($userId);

        // Active and Inactive Users Calculation
        $activeUsers = User::whereIn('id', $downline)->where('status', 1)->count();
        $inactiveUsers = User::whereIn('id', $downline)->where('status', 0)->count();

        // Total Deposit and Withdrawal for the Downline
        $downlineDeposit = Deposit::whereIn('user_id', $downline)->where('payment_status', 1)->sum('final_amount');
        $downlineWithdraw = Withdraw::whereIn('user_id', $downline)->where('status', 1)->sum('withdraw_amount');
---
select count(*) as aggregate from `users` where `id` in (30, 31, 40, 47, 55, 57, 62, 68, 72, 86, 87, 113, 114, 118, 120, 125, 126, 166, 171, 180, 226, 236, 238, 250, 283, 343, 348, 398, 400, 408, 429, 447, 452, 501, 503, 652, 776, 777, 744, 793, 748, 269, 276, 284, 414, 504, 552, 555, 594, 599, 687, 691, 697, 709, 734, 742, 569, 636, 661, 710, 743, 690, 66, 248, 614, 324, 353, 359, 747, 657, 117, 122, 241, 244, 316, 344, 800, 158, 167, 314, 689, 161, 357, 571, 619, 713, 91, 181, 312, 306, 322, 332, 345, 374, 707, 711, 752, 754, 769, 781, 796, 797, 803, 804, 782, 128, 162, 164, 328, 138, 152, 169, 172, 174, 173, 182, 187, 222, 285, 184, 701, 352, 372, 373, 388, 389, 393, 394, 397, 419, 420, 425, 426, 430, 431, 438, 449, 456, 464, 484, 486, 493, 495, 496, 497, 499, 505, 512, 522, 523, 559, 562, 565, 567, 572, 573, 581, 583, 590, 595, 630, 655, 662, 665, 699, 700, 702, 703, 719, 735, 741, 799, 807, 377, 387, 411, 516, 517, 550, 556, 441, 422, 554, 421, 442, 433, 463, 467, 490, 663, 470, 485, 568, 593, 613, 660, 602, 617, 658, 810, 811, 812, 718) and `status` = 1
select count(*) as aggregate from `users` where `id` in (30, 31, 40, 47, 55, 57, 62, 68, 72, 86, 87, 113, 114, 118, 120, 125, 126, 166, 171, 180, 226, 236, 238, 250, 283, 343, 348, 398, 400, 408, 429, 447, 452, 501, 503, 652, 776, 777, 744, 793, 748, 269, 276, 284, 414, 504, 552, 555, 594, 599, 687, 691, 697, 709, 734, 742, 569, 636, 661, 710, 743, 690, 66, 248, 614, 324, 353, 359, 747, 657, 117, 122, 241, 244, 316, 344, 800, 158, 167, 314, 689, 161, 357, 571, 619, 713, 91, 181, 312, 306, 322, 332, 345, 374, 707, 711, 752, 754, 769, 781, 796, 797, 803, 804, 782, 128, 162, 164, 328, 138, 152, 169, 172, 174, 173, 182, 187, 222, 285, 184, 701, 352, 372, 373, 388, 389, 393, 394, 397, 419, 420, 425, 426, 430, 431, 438, 449, 456, 464, 484, 486, 493, 495, 496, 497, 499, 505, 512, 522, 523, 559, 562, 565, 567, 572, 573, 581, 583, 590, 595, 630, 655, 662, 665, 699, 700, 702, 703, 719, 735, 741, 799, 807, 377, 387, 411, 516, 517, 550, 556, 441, 422, 554, 421, 442, 433, 463, 467, 490, 663, 470, 485, 568, 593, 613, 660, 602, 617, 658, 810, 811, 812, 718) and `status` = 0
select sum(`final_amount`) as aggregate from `deposits` where `user_id` in (30, 31, 40, 47, 55, 57, 62, 68, 72, 86, 87, 113, 114, 118, 120, 125, 126, 166, 171, 180, 226, 236, 238, 250, 283, 343, 348, 398, 400, 408, 429, 447, 452, 501, 503, 652, 776, 777, 744, 793, 748, 269, 276, 284, 414, 504, 552, 555, 594, 599, 687, 691, 697, 709, 734, 742, 569, 636, 661, 710, 743, 690, 66, 248, 614, 324, 353, 359, 747, 657, 117, 122, 241, 244, 316, 344, 800, 158, 167, 314, 689, 161, 357, 571, 619, 713, 91, 181, 312, 306, 322, 332, 345, 374, 707, 711, 752, 754, 769, 781, 796, 797, 803, 804, 782, 128, 162, 164, 328, 138, 152, 169, 172, 174, 173, 182, 187, 222, 285, 184, 701, 352, 372, 373, 388, 389, 393, 394, 397, 419, 420, 425, 426, 430, 431, 438, 449, 456, 464, 484, 486, 493, 495, 496, 497, 499, 505, 512, 522, 523, 559, 562, 565, 567, 572, 573, 581, 583, 590, 595, 630, 655, 662, 665, 699, 700, 702, 703, 719, 735, 741, 799, 807, 377, 387, 411, 516, 517, 550, 556, 441, 422, 554, 421, 442, 433, 463, 467, 490, 663, 470, 485, 568, 593, 613, 660, 602, 617, 658, 810, 811, 812, 718) and `payment_status` = 1
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` in (30, 31, 40, 47, 55, 57, 62, 68, 72, 86, 87, 113, 114, 118, 120, 125, 126, 166, 171, 180, 226, 236, 238, 250, 283, 343, 348, 398, 400, 408, 429, 447, 452, 501, 503, 652, 776, 777, 744, 793, 748, 269, 276, 284, 414, 504, 552, 555, 594, 599, 687, 691, 697, 709, 734, 742, 569, 636, 661, 710, 743, 690, 66, 248, 614, 324, 353, 359, 747, 657, 117, 122, 241, 244, 316, 344, 800, 158, 167, 314, 689, 161, 357, 571, 619, 713, 91, 181, 312, 306, 322, 332, 345, 374, 707, 711, 752, 754, 769, 781, 796, 797, 803, 804, 782, 128, 162, 164, 328, 138, 152, 169, 172, 174, 173, 182, 187, 222, 285, 184, 701, 352, 372, 373, 388, 389, 393, 394, 397, 419, 420, 425, 426, 430, 431, 438, 449, 456, 464, 484, 486, 493, 495, 496, 497, 499, 505, 512, 522, 523, 559, 562, 565, 567, 572, 573, 581, 583, 590, 595, 630, 655, 662, 665, 699, 700, 702, 703, 719, 735, 741, 799, 807, 377, 387, 411, 516, 517, 550, 556, 441, 422, 554, 421, 442, 433, 463, 467, 490, 663, 470, 485, 568, 593, 613, 660, 602, 617, 658, 810, 811, 812, 718) and `status` = 1

    public function getDownline($userId)
    {
        // Fetch all users who were referred by the given user
        $downline = User::where('reffered_by', $userId)->pluck('id')->toArray();
---
select `id` from `users` where `reffered_by` = 27

            ->whereNotNull('next_payment_date') // ✅ Only running plans
            ->count();

        $totalInvestedMembersLevel3 = Payment::whereIn('user_id', $levelThreeUsers)
            ->where('payment_status', 1)
            ->whereNotNull('next_payment_date') // ✅ Only running plans
            ->distinct('user_id')
            ->count('user_id');
---
select count(distinct `user_id`) as aggregate from `payments` where 0 = 1 and `payment_status` = 1 and `next_payment_date` is not null