core/app/Http/Controllers/Admin/ManageGatewayController.php

select * from `deposits` where `payment_type` = 0 and exists (select * from `users` where `deposits`.`user_id` = `users`.`id` and `email` LIKE '%statisticsstiger123@gmail.com%') order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (53, 62, 214, 325, 326, 564, 785, 807, 810, 811, 812, 816)
select count(*) as aggregate from `deposits` where `payment_type` = 0 and exists (select * from `users` where `deposits`.`user_id` = `users`.`id` and `email` LIKE '%statisticsstiger123@gmail.com%')
---
    public function depositLog(Request $request)
    {
        $data['pageTitle'] = "Deposit Log";
        $data['navDepositPaymentActiveClass'] = 'active';

        $manuals = Deposit::query()->where('payment_type', 0)->with('user');

        // **Search by Email**
        if ($request->has('email') && !empty($request->email)) {
            $email = $request->email;
            $manuals->whereHas('user', function ($query) use ($email) {
                $query->where('email', 'LIKE', "%{$email}%");
            });
        }

        $data['manuals'] = $manuals->latest()->paginate(10);

select * from `deposits` where `transaction_id` = 'S8QGS8O1POEHJNNI' limit 1
select * from `users` where `users`.`id` in (732)
---
    public function depositDetails(Request $request)
{
    $pageTitle = "Payment Details";

    $manual = Deposit::where('transaction_id', $request->trx)->with('user')->firstOrFail();