core/app/Http/Controllers/Admin/ManageUserController.php

select * from `users` order by `created_at` desc limit 15 offset 795
select count(*) as aggregate from `users`
---
    public function index()
    {

        $data['pageTitle'] = 'All Users';
        $data['navManageUserActiveClass'] = 'active';
        $data['subNavManageUserActiveClass'] = 'active';

        $data['users'] = User::latest()->paginate();

select * from `users` limit 10 offset 790
select count(*) as aggregate from `users`
---
    public function SearchUser(Request $request)
{
    $query = User::query();

    // Agar search input diya gaya hai to filter apply karo
    if ($request->has('search')) {
        $search = $request->search;
        $query->where(function ($q) use ($search) {
            $q->where('email', 'LIKE', "%{$search}%")
              ->orWhere('username', 'LIKE', "%{$search}%")
              ->orWhere('phone', 'LIKE', "%{$search}%");
        });
    }

    // Paginate users
    $users = $query->paginate(10);

select * from `users` where `id` = '816' limit 1
select * from `user_interests` where `user_interests`.`user_id` = 816 and `user_interests`.`user_id` is not null
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 816 and `status` = 1
select sum(`amount`) as aggregate from `deposits` where `deposits`.`user_id` = 816 and `deposits`.`user_id` is not null and `payment_status` = 1
select sum(`amount`) as aggregate from `payments` where `payments`.`user_id` = 816 and `payments`.`user_id` is not null and `payment_status` = 1
select * from `payments` where `user_id` = 816 and `payment_status` = 1 order by `created_at` desc limit 1
select * from `plans` where `plans`.`id` in (48)
select SUM(final_amount) as total, MONTHNAME(created_at) month from `payments` where `payment_status` = 1 and `user_id` = 816 group by `month`
select SUM(withdraw_amount) as total, MONTHNAME(created_at) month from `withdraws` where `status` = 1 and `user_id` = 816 group by `month`
---
    public function userDetails(Request $request)
    {
        $user = User::where('id', $request->user)->firstOrFail();

        // Existing Code for Current User Details
        $totalRef = $user->refferals->count();
        $userInterest = $user->interest->sum('interest_amount');
        $userCommission = $user->commissions->sum('amount');
        $withdrawTotal = Withdraw::where('user_id', $user->id)->where('status', 1)->sum('withdraw_amount');
        $totalDeposit = $user->deposits()->where('payment_status', 1)->sum('amount');
        $totalInvest = $user->payments()->where('payment_status', 1)->sum('amount');
        $totalTicket = $user->tickets->count();

        $payment = Payment::with('plan')->where('user_id', $user->id)->where('payment_status', 1)->latest()->first();
        $plan = $payment ? $payment->plan->plan_name : 'N/A';

        // For Monthly Deposits and Withdrawals
        $months = collect([]);
        $totalAmount = collect([]);
        $withdrawMonths = collect([]);
        $withdrawTotalAmount = collect([]);

        Payment::where('payment_status', 1)->where('user_id', $user->id)
            ->select(DB::raw('SUM(final_amount) as total'), DB::raw('MONTHNAME(created_at) month'))
            ->groupBy('month')
            ->get()
            ->map(function ($q) use ($months, $totalAmount) {
                $months->push($q->month);
                $totalAmount->push($q->total);
            });

        Withdraw::where('status', 1)->where('user_id', $user->id)
            ->select(DB::raw('SUM(withdraw_amount) as total'), DB::raw('MONTHNAME(created_at) month'))
            ->groupBy('month')
            ->get()
            ->map(function ($q) use ($withdrawMonths, $withdrawTotalAmount) {
                $withdrawMonths->push($q->month);
                $withdrawTotalAmount->push($q->total);
            });

select count(*) as aggregate from `users` where `id` in (30, 31, 40, 47, 55, 57, 62, 68, 72, 86, 87, 113, 114, 118, 120, 125, 126, 166, 171, 180, 226, 236, 238, 250, 283, 343, 348, 398, 400, 408, 429, 447, 452, 501, 503, 652, 776, 777, 744, 793, 748, 269, 276, 284, 414, 504, 552, 555, 594, 599, 687, 691, 697, 709, 734, 742, 569, 636, 661, 710, 743, 690, 66, 248, 614, 324, 353, 359, 747, 657, 117, 122, 241, 244, 316, 344, 800, 158, 167, 314, 689, 161, 357, 571, 619, 713, 91, 181, 312, 306, 322, 332, 345, 374, 707, 711, 752, 754, 769, 781, 796, 797, 803, 804, 782, 128, 162, 164, 328, 138, 152, 169, 172, 174, 173, 182, 187, 222, 285, 184, 701, 352, 372, 373, 388, 389, 393, 394, 397, 419, 420, 425, 426, 430, 431, 438, 449, 456, 464, 484, 486, 493, 495, 496, 497, 499, 505, 512, 522, 523, 559, 562, 565, 567, 572, 573, 581, 583, 590, 595, 630, 655, 662, 665, 699, 700, 702, 703, 719, 735, 741, 799, 807, 377, 387, 411, 516, 517, 550, 556, 441, 422, 554, 421, 442, 433, 463, 467, 490, 663, 470, 485, 568, 593, 613, 660, 602, 617, 658, 810, 811, 812, 718) and `status` = 1
select count(*) as aggregate from `users` where `id` in (30, 31, 40, 47, 55, 57, 62, 68, 72, 86, 87, 113, 114, 118, 120, 125, 126, 166, 171, 180, 226, 236, 238, 250, 283, 343, 348, 398, 400, 408, 429, 447, 452, 501, 503, 652, 776, 777, 744, 793, 748, 269, 276, 284, 414, 504, 552, 555, 594, 599, 687, 691, 697, 709, 734, 742, 569, 636, 661, 710, 743, 690, 66, 248, 614, 324, 353, 359, 747, 657, 117, 122, 241, 244, 316, 344, 800, 158, 167, 314, 689, 161, 357, 571, 619, 713, 91, 181, 312, 306, 322, 332, 345, 374, 707, 711, 752, 754, 769, 781, 796, 797, 803, 804, 782, 128, 162, 164, 328, 138, 152, 169, 172, 174, 173, 182, 187, 222, 285, 184, 701, 352, 372, 373, 388, 389, 393, 394, 397, 419, 420, 425, 426, 430, 431, 438, 449, 456, 464, 484, 486, 493, 495, 496, 497, 499, 505, 512, 522, 523, 559, 562, 565, 567, 572, 573, 581, 583, 590, 595, 630, 655, 662, 665, 699, 700, 702, 703, 719, 735, 741, 799, 807, 377, 387, 411, 516, 517, 550, 556, 441, 422, 554, 421, 442, 433, 463, 467, 490, 663, 470, 485, 568, 593, 613, 660, 602, 617, 658, 810, 811, 812, 718) and `status` = 0
select sum(`final_amount`) as aggregate from `deposits` where `user_id` in (30, 31, 40, 47, 55, 57, 62, 68, 72, 86, 87, 113, 114, 118, 120, 125, 126, 166, 171, 180, 226, 236, 238, 250, 283, 343, 348, 398, 400, 408, 429, 447, 452, 501, 503, 652, 776, 777, 744, 793, 748, 269, 276, 284, 414, 504, 552, 555, 594, 599, 687, 691, 697, 709, 734, 742, 569, 636, 661, 710, 743, 690, 66, 248, 614, 324, 353, 359, 747, 657, 117, 122, 241, 244, 316, 344, 800, 158, 167, 314, 689, 161, 357, 571, 619, 713, 91, 181, 312, 306, 322, 332, 345, 374, 707, 711, 752, 754, 769, 781, 796, 797, 803, 804, 782, 128, 162, 164, 328, 138, 152, 169, 172, 174, 173, 182, 187, 222, 285, 184, 701, 352, 372, 373, 388, 389, 393, 394, 397, 419, 420, 425, 426, 430, 431, 438, 449, 456, 464, 484, 486, 493, 495, 496, 497, 499, 505, 512, 522, 523, 559, 562, 565, 567, 572, 573, 581, 583, 590, 595, 630, 655, 662, 665, 699, 700, 702, 703, 719, 735, 741, 799, 807, 377, 387, 411, 516, 517, 550, 556, 441, 422, 554, 421, 442, 433, 463, 467, 490, 663, 470, 485, 568, 593, 613, 660, 602, 617, 658, 810, 811, 812, 718) and `payment_status` = 1
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` in (30, 31, 40, 47, 55, 57, 62, 68, 72, 86, 87, 113, 114, 118, 120, 125, 126, 166, 171, 180, 226, 236, 238, 250, 283, 343, 348, 398, 400, 408, 429, 447, 452, 501, 503, 652, 776, 777, 744, 793, 748, 269, 276, 284, 414, 504, 552, 555, 594, 599, 687, 691, 697, 709, 734, 742, 569, 636, 661, 710, 743, 690, 66, 248, 614, 324, 353, 359, 747, 657, 117, 122, 241, 244, 316, 344, 800, 158, 167, 314, 689, 161, 357, 571, 619, 713, 91, 181, 312, 306, 322, 332, 345, 374, 707, 711, 752, 754, 769, 781, 796, 797, 803, 804, 782, 128, 162, 164, 328, 138, 152, 169, 172, 174, 173, 182, 187, 222, 285, 184, 701, 352, 372, 373, 388, 389, 393, 394, 397, 419, 420, 425, 426, 430, 431, 438, 449, 456, 464, 484, 486, 493, 495, 496, 497, 499, 505, 512, 522, 523, 559, 562, 565, 567, 572, 573, 581, 583, 590, 595, 630, 655, 662, 665, 699, 700, 702, 703, 719, 735, 741, 799, 807, 377, 387, 411, 516, 517, 550, 556, 441, 422, 554, 421, 442, 433, 463, 467, 490, 663, 470, 485, 568, 593, 613, 660, 602, 617, 658, 810, 811, 812, 718) and `status` = 1
select * from `account_binds` where `user_id` = 816 limit 1
---
        $downline = $this->getDownline($user->id);

        // Active and Inactive Users Calculation
        $activeUsers = User::whereIn('id', $downline)->where('status', 1)->count();
        $inactiveUsers = User::whereIn('id', $downline)->where('status', 0)->count();

        // Total Deposit and Withdrawal for the Downline
        $downlineDeposit = Deposit::whereIn('user_id', $downline)->where('payment_status', 1)->sum('final_amount');
        $downlineWithdraw = Withdraw::whereIn('user_id', $downline)->where('status', 1)->sum('withdraw_amount');

        $accountBind = AccountBind::where('user_id',  $user->id)->first();

select `id` from `users` where `reffered_by` = 816
---
    public function getDownline($userId)
    {
        // Fetch all users who were referred by the given user
        $downline = User::where('reffered_by', $userId)->pluck('id')->toArray();

update `users` set `password` = '$2y$10$zUrQkaqr55NBf16CXhNTpunrWsvaFFMjhy3RVKXBsoy2fC2jmQ0v.', `users`.`updated_at` = '2025-03-01 12:41:36' where `id` = 816
---
    public function userPasswordUpdate(Request $request, User $user){
        $request->validate([
            'change_pass' => 'nullable|min:8', // Password optional but must be at least 6 chars
        ]);




        if ($request->filled('change_pass')) {
            $user->password = Hash::make($request->change_pass);
        }

        $user->save();

select * from `users` where `users`.`id` = '816' limit 1
---
    public function loginAsUser($id)
    {
        $user = User::findOrFail($id);