core/app/Http/Controllers/Auth/RegisterController.php

    public function __construct()
    {
        $general = GeneralSetting::first();
---
select * from `general_settings` limit 1

    public function register(Request $request)
    {

        $general = GeneralSetting::first();
---
select * from `general_settings` limit 1

    public function create($request, $signupBonus, $referid)
    {
        return User::create([
            'fname' => $request->fname,
            'balance' => $signupBonus,
            'lname' => $request->lname,
            'username' => $request->username,
            'email' => $request->email,
            'phone' => $request->phone,
            'status' => 1,
            'password' => bcrypt($request->password),
            'reffered_by' => $referid ?? ''
        ]);
---
insert into `users` (`fname`, `balance`, `lname`, `username`, `email`, `phone`, `status`, `password`, `reffered_by`, `updated_at`, `created_at`) values ('Andrew', '0.00000000', 'Buck', 'vacatila', 'kefudy@mailinator.com', 'zufa@mailinator.com', 1, '$2y$10$wPQgS2H/lyLBGDTEJLYVgeobxFWtTg38lwID5JsnTUGV0ZC44yd.2', 0, '2025-03-01 00:45:06', '2025-03-01 00:45:06')